In [235]:
#import pandas

import pandas as pd

In [236]:
#Import Modules
import numpy as np
import os
import csv

In [237]:
#Set path for file

csvpath = os.path.join("Resources", "purchase_data.csv")

In [238]:
#Set table to data frame

df_purchase_data = pd.read_csv(csvpath)
df_purchase_data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [239]:
#DETERMINE PLAYER COUNT

unique_players = pd.DataFrame([{"Individual Players": df_purchase_data["SN"].nunique()}])
unique_players

   Individual Players
0                 576

In [240]:
#ANALYZE PURCHASING TOTALS:
#Number of Unique Items, Average Purchase Price, Total Number of Purchases, Total Revenue

In [241]:
#Number of unique items
unique_items = pd.DataFrame([{"Item Name": df_purchase_data["Item_Name"].nunique()}])
unique_items

   Item Name
0        179

In [242]:
#Average Purchase Price:
purchase_price = pd.DataFrame([{"Average Price": df_purchase_data["Price"].mean()}])
#Round average purchase price:
purchase_price.round(2)

   Average Price
0           3.05

In [243]:
#Total Number of Purchases:
total_purchases = pd.DataFrame([{"Total Purchases": df_purchase_data["Price"].count()}])
total_purchases

   Total Purchases
0              780

In [244]:
#Total Revenue
total_revenue = df_purchase_data["Price"].sum()
total_revenue

2379.77

In [245]:
#ANALYZE GENDER DEMOGRAPHICS:
# % and Count of Male Players, 
# % and Count of Female Players, 
# % and Count of Other/Non-disclosed Players

In [246]:
#Count of players by gender category, and percentage by gender

#Create dataframe that indicates the number of each gender category                  
Gender = df_purchase_data.groupby("Gender").nunique()
Male = Gender.iloc[1,1]
Female = Gender.iloc[0,1]
Other = Gender.iloc[2,1]

#Create a dataframe that calculates the totals and percentages of each gender category
df_percentage = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/Not Disclosed"],
    "Total": [Male, Female, Other],
    "Percentage": [100*Male/df_purchase_data["SN"].nunique(), 
                    100*Female/df_purchase_data["SN"].nunique(), 
                    100*Other/df_purchase_data["SN"].nunique()]
})

df_percentage.loc["Total Players"]= df_percentage.sum(axis=0,numeric_only=True)
df_percentage.loc["Total Players", "Gender"] = ""

#Format the percentages to two decimals
df_percentage = df_percentage.round(2)

#Print out the total of each gender category and its percentage in a table
df_percentage

                            Gender  Total  Percentage
0                             Male  484.0       84.03
1                           Female   81.0       14.06
2              Other/Not Disclosed   11.0        1.91
Total Players                       576.0      100.00

In [247]:
#Analyze Purchasing by Gender: 

#For each gender, determine
#Purchase Count, Average Purchase Price, Total Purchase Value

In [254]:
df_gender_2 = df_purchase_data.groupby('Gender')

Total_Purchase_Counts = round(df_gender_2['Price'].count(), 0)
Avg_Purchase_Price = round(df_gender_2['Price'].mean(), 2)
Total_Purchase_Values = round(df_gender_2['Price'].sum(), 2)
Purchase_Value_Per_Gender = round(Total_Purchase_Values / Total_Purchase_Counts, 2)

summary_dataframe2 = pd.DataFrame([Total_Purchase_Counts, Avg_Purchase_Price, Total_Purchase_Values, Purchase_Value_Per_Gender])
summary2 = summary_dataframe2.T
summary2.columns = ['Total Purchase Count', 'Average Purchase Price', 'Total Purchase Value', 'Avg Total Purchase per Person']
summary2

,Total Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113.0,3.20,361.94,3.20
Male,652.0,3.02,1967.64,3.02
Other / Non-Disclosed,15.0,3.35,50.19,3.35

In [249]:
#Average Total Purchases per Person by Gender

# CALCULATE THE TOTAL REVENUE 
Avg_Purchases_Per = df_purchase_data.groupby(["SN","Gender"])["Price"].mean().agg(lambda x: x.unique())

Avg_Purchases_Per = pd.DataFrame({"Average Price": gender_price, "Total Purchases": count,
    "Total Revenue": gender_revenue})

#genders["Average Price"] = genders["Average Price"].map("${:.2f}".format)
#genders["Total Revenue"] = genders["Total Revenue"].map("${:.2f}".format)
#genders
#purchase_data.head()
#Avg_Purchases_Per = pd.DataFrame({df_purchase_data.groupby(["SN","Gender"]).mean()["Price"].agg(lambda x: x.unique())
                                 #})
#Avg_Purchases_Per = Avg_Purchases_Per.round(2)
Avg_Purchases_Per

NameError: name 'gender_price' is not defined

In [230]:
#ANALYZE AGE DEMOGRAPHICS:

In [287]:
#Determine total age range

#minimum age
minValue = df_purchase_data["Age"].min()
print("minimum value in column 'Age': " , minValue)

minimum value in column 'Age':  7

In [288]:
#maximum age
maxValue = df_purchase_data["Age"].max()
print("maximum value in column 'Age': " , maxValue)

maximum value in column 'Age':  45

In [289]:
#Break age groups into bins of 4 years
# Create the bins in which Data will be held
# Bins are 0, 10, 14, 18, 22, 26, 30, 34, 38, 42, 45   
bins = [0, 10, 14, 18, 22, 26, 30, 34, 38, 42, 45]

# Create the names for the bins
group_names = ["7-10", "11-14", "15-18", "19-22", "23-26", "27-30", "31-34", "35-38", "39-42", "43+"]
df_purchase_data["Age Groups"] = pd.cut(df_purchase_data["Age"], bins, labels=group_names, include_lowest=True)
df_purchase_data

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,19-22
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,39-42
2,2,Ithergue48,24,Male,92,Final Critic,4.88,23-26
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,23-26
4,4,Iskosia90,23,Male,131,Fury,1.44,23-26
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,19-22
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,19-22
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,19-22
778,778,Sisur91,7,Male,92,Final Critic,4.19,7-10
779,779,Ennrian78,24,Male,50,Dawn,4.60,23-26

In [290]:
#Within age bins, get purchase count

#Creating a group based off of the bins/clean data of NaN's
#df_age_groups = df_purchase_data.apply(pd.to_numeric, errors = 'coerce')
#df_age_groups = df_purchase_data.dropna()
#df_age_groups = df_purchase_data.reset_index(drop=True)
#df_avg_tot_purch = df_purchase_data.groupby(["SN", "Gender"])["Price"].agg(lambda x: x.unique().mean())
#df_avg_tot_purch.head()

#df_avg_tot_purch[df_avg_tot_purch.index.isin(["Male"], level="Gender")]
test = pd.DataFrame (df_purchase_data, columns = )

df_age_purch = df_purchase_data.groupby(["Age Groups", "Purchase_ID"]).count()
print(df_age_purch)

#HOW DO I GET RID OF ALL THESE NaNs?????? I tried a million ways.

SyntaxError: invalid syntax (<ipython-input-290-5ad5f45ad7bf>, line 11)

In [291]:
#Within age bin 1, get average purchase price total per person

#df_avg_tot_purch = df_purchase_data.groupby(["SN", "Gender"])["Price"].agg(lambda x: x.unique().mean())
#df_avg_tot_purch.head()

#df_avg_tot_purch[df_avg_tot_purch.index.isin(["Male"], level="Gender")]

In [292]:
#Within age groups, get average purchase total

In [293]:
#ANALYZE TOP SPENDERS:

In [315]:
#Determine top 5 spenders by purchase price

top_spenders_df = df_purchase_data.sort_values(by = ['Price'], ascending=[False])

df_test = top_spenders_df.head(5)
top_spenders_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age Groups
554,554,Dyally87,22,Male,63,Stormfury Mace,4.99,19-22
189,189,Hiasri33,23,Male,63,Stormfury Mace,4.99,23-26
110,110,Ririp86,25,Male,139,"Mercy, Katana of Dismay",4.94,23-26
246,246,Lirtilsa71,24,Male,139,"Mercy, Katana of Dismay",4.94,23-26
493,493,Chanirrasta87,14,Male,139,"Mercy, Katana of Dismay",4.94,11-14

In [332]:
#List them in a table with the following information
#SN, Purchase Count, Average Purchase Price, Total Purchase Price
#drop columns not needed from original table
df_top_spenders_table = pd.DataFrame({
    "SN":df_test["SN"], 
    "Purchase_Count":df_test["Purchase_ID"].count(),
    "Avg_Purchase_Price":[4.99/5, 4.99/5, 4.94/5, 4.94/5, 4.94/5],
    "Total Purchase Price":df_test["Price"]
})
df_top_spenders_table

                SN  Purchase_Count  Avg_Purchase_Price  Total Purchase Price
554       Dyally87               5               0.998                  4.99
189       Hiasri33               5               0.998                  4.99
110        Ririp86               5               0.988                  4.94
246     Lirtilsa71               5               0.988                  4.94
493  Chanirrasta87               5               0.988                  4.94

In [ ]:
#DETERMINE MOST POPULAR ITEMS

In [340]:
#Identify the 5 most popular items by purchase count
num_items_df = df_purchase_data.groupby("Item_Name").count()
pop_items_df = df_purchase_data.sort_values(by = ['Item_Name'], ascending=[False])
num_items_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Price,Age Groups
Item_Name,,,,,,,
Abyssal Shard,5,5,5,5,5,5,5
"Aetherius, Boon of the Blessed",5,5,5,5,5,5,5
Agatha,6,6,6,6,6,6,6
Alpha,3,3,3,3,3,3,3
"Alpha, Oath of Zeal",3,3,3,3,3,3,3

In [352]:
#List them in a table with the following information
#Item ID, Item Name, #Purchase Count, #Item Price, #Total Purchase Value
df_pop_items_table = pd.DataFrame({
    "Item_ID":[162, 137, 120, 130, 79], 
    "Purchase_Count":[5,5,6,3,3],
    "Item Price":[2.67, 3.39, 3.08, 2.07, 4.05],
    "Total Purchase Value":[13.35, 16.95, 18.48, 6.21, 12.05]
})
df_pop_items_table

   Item_ID  Purchase_Count  Item Price  Total Purchase Value
0      162               5        2.67                 13.35
1      137               5        3.39                 16.95
2      120               6        3.08                 18.48
3      130               3        2.07                  6.21
4       79               3        4.05                 12.05

In [ ]:
#DETERMINE MOST PROFITABLE ITEMS

In [371]:
#Identify the 5 most profitable items by total purchase value
prof_items_df = df_purchase_data.groupby("Price")["Item_Name"].nunique()
profitable_items_df = df_purchase_data.sort_values(by = ['Price'], ascending=[False])

profitable_items_df.head(5)

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age Groups
554,554,Dyally87,22,Male,63,Stormfury Mace,4.99,19-22
189,189,Hiasri33,23,Male,63,Stormfury Mace,4.99,23-26
110,110,Ririp86,25,Male,139,"Mercy, Katana of Dismay",4.94,23-26
246,246,Lirtilsa71,24,Male,139,"Mercy, Katana of Dismay",4.94,23-26
493,493,Chanirrasta87,14,Male,139,"Mercy, Katana of Dismay",4.94,11-14

In [ ]:
#List them in a table with the following information
#Item ID, Item Name, Purchase Count, Itemm Price, Total Purchase Value